import React from 'react';
import { useNavigate } from 'react-router-dom';

function Home() {
  const navigate = useNavigate();

  return (
    <div className="home-container">
      <h1>לְפְּסָפֶס את ההָלָכָה</h1>
      <h3> סקר אינטראקטבי למיפוי צמתי ההחלטה של דתיות ודתיים על הרצף</h3>
      {/* Video Section */}
      <div className="video-container">
        <video width="100%" controls>
          <source src="/src/assets/intro_clip1.mp4" type="video/mp4" />
          הדפדפן שלך אינו תומך בהצגת וידאו.
        </video>
      </div>
      
      {/* Explanation Paragraph */}
      <h3> אמ;לק לסרטון:</h3>
      <p>
    אני שי אברג'ל, אני סטודנט לתואר שני בעיצוב לסביבות טכנולוגיות במכון הטכנולוגי חולון 
    במסגרת פרויקט הגמר שלי בניתי סקר אינטראקטיבי שמטרתו ללמוד על דילמות והחלטות של בוגרי מערכת החינוך הדתי שנמצאים על הרצף הדתי. אני רוצה לשמוע מכם – על רגעים שבהם התלבטתם איך לשמור מצווה, ניסיתם להתאים או לשנות הרגלים דתיים לאורח החיים הנוכחי שלכם, או שארגנתם מחדש מחשבות התפיסה הדתית שלכם.
    <br></br>
    איך זה עובד? <br></br>
 📌 חלק ראשון – כמה שאלות כלליות ביוגרפיותץ<br></br>
 📌 חלק שני – שאלות פתוחות על ההתנסות האישית שלכם<br></br>
 📌 חלק שלישי נצלול – שאלות ממוקדות יותר, לפי נושא שתבחרו. תוכלו לענות על החלק השלישי מספר פעמים, ובכל פעם לבחור נושא אחר.<br></br><br></br>
אין תשובה "נכונה" או "לא נכונה" – כל נקודת מבט מעשירה את התמונה שאני מנסה לצייר בסקר. בבקשה הרגישו בנוח לענות על השאלות כפי שאתם מבינים אותם. אני מאמין שהעולם הדתי הפנימי שלנו הוא עולם מגוון ותלוי בהרבה פרמטרים בהיסטוריה האישית שלנו - לכן השאלות הן סוייקטיביות ולעיתים ניתן לפרש אותן ליותר מכיוון אחד. אני מזמין אתכם לפרט, לספר, לחפור – ממליץ בחום להשתמש בתוכנות שממירות דיבור לטקסט.<br></br><br></br>
🔒 פרטיותכם חשובה – הנתונים הביוגרפיים נשמרים בנפרד, למטרות ניתוח סטטיסטי בלבד.<br></br>
 📩 בסוף הסקר תוכלו להשאיר פרטים אם תרצו להשתתף בהמשך המחקר.
תודה רבה על ההשתתפות
      </p>
      
      <button className="start-button" onClick={() => navigate('/Statistic_questions')}>בואו נתחיל</button>
    </div>
  );
}

export default Home;
